# Ввод данных в программу
# Типы
#   int - целое число
#   float - вещественные числа
#   bool - логический оператор
#   str - строка

a = input()# Базовый input
print()

fam = input('Введите фамилию: ')# Подсказка-текст
im = print('Введите имя: ')
print()
print('Введите имя, а затем фамилию: ')
fam = input()
im = print()

# преобразование символьной строки
i = int(input())
f = float(input())

# множественные присваивания
a, b, c = 7, 2, -5

a = 7
b = 2
c = -7

a = b = 0

b = 0
a = 0

a, b = b, a

# математические операции
c = a + b # сложение
c = a - b # вычиатние
c = a * b # умножение
c = a / b # деление
c = a ** b # степень

# модуль математики
import math

